---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.NoPartMakerCreatedInEditMode
source: html/e710055e-ecd9-b6c9-aeba-262a1617a750.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.NoPartMakerCreatedInEditMode Property

Nothing will be divided.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoPartMakerCreatedInEditMode { get; }
```